tutorials/forcedConvection&phaseChangeMaterial/constant/chamber/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;
type            PCM;

nu		nu [0 2 -1 0 0 0 0]	6.7e-6;
rho		rho [1 -3 0 0 0 0 0]	912;
Cp		Cp [0 2 -2 -1 0 0 0]	2285;
Pr		Pr [0 0 0 0 0 0 0]	93.1;
Prt		Prt [0 0 0 0 0 0 0]	0.85;
beta            beta [0 0 0 -1 0 0 0]	9e-5;
TRef            TRef [0 0 0 1 0 0 0]	298.15;
hm		hm [0 2 -2 0 0 0 0]	187210.0;
Tm		Tm [0 0 0 1 0 0 0]	319.0;
Tmr		Tmr [0 0 0 1 0 0 0]	4.7;
Cu		Cu [1 -3 -1 0 0 0 0]	1.0e5;
b		b [0 0 0 0 0 0 0]	1.0e-3;
// ************************************************************************* //
