tutorials/forcedConvection&phaseChangeMaterial/constant/channel/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;
type            forcedConvection;

nu		nu [0 2 -1 0 0 0 0]	0.85e-6;
rho		rho [1 -3 0 0 0 0 0]	912;
Cp		Cp [0 2 -2 -1 0 0 0]	2285;
Pr		Pr [0 0 0 0 0 0 0]	93.1;
Prt		Prt [0 0 0 0 0 0 0]	0.85;

// ************************************************************************* //
